docs/posts/2017-06-26-making-beautiful-things.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 24, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Making Beautiful Things</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Making Beautiful Things</h1>
<p class="subtitle" role="doc-subtitle">Jun 26, 2017</p>
</header><p>
Yesterday&rsquo;s worship at <a href="http://www.northhavenchurch.net">NorthHaven Church</a> was planned and led by Autumn Lockett, Josh Lockett, and Chris Canary. I was particularly struck by the words of one of the songs: &ldquo;You make beautiful things out of the dust&#x2026; You make beautiful things out of us.&rdquo;
</p>

<p>
Those words were exemplified later when the members of the congregation gathered to each put fingerprint leaves on Josh Lockett&rsquo;s sketch of a tree, fingerprints from the young and the old, from those who have been in the community for years, and from those who have been there for only months. Each contributed to the beauty of the painting, just as each has contributed to the beauty that is the NorthHaven community, diverse individuals connected by branches of relationship to a common trunk that is NorthHaven Church. When I widen my perspective, though, I see that what looks like a trunk is just another branch &#x2014; one that is connected to other branches through Jesus Christ, and together we form the tree that is the Church, holy and catholic.
</p>

<p>
May God continue to make beautiful things out of all of us.
</p>

<p>
<i>Amen</i>
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 24, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
